libxmlbus/data/wsaddr-testset/documents/echo/soap11/message7.xml

<?xml version="1.0"?>
<!-- $Id: message7.xml,v 1.5 2006/01/19 06:05:30 hugo Exp $ -->
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing">
  <env:Header>
    <wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To>
    <wsa:Action>http://example.org/action/echoIn</wsa:Action>
    <wsa:MessageID>D6202742-D9D9-4023-8167-EF0AB81042EC</wsa:MessageID>
    <wsa:ReplyTo>
      <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
      <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
        <customer:CustomerKey>Key#123456789</customer:CustomerKey>
      </wsa:ReferenceParameters>
    </wsa:ReplyTo>
  </env:Header>
  <env:Body>
    <m:echoIn xmlns:m="http://example.org/echo">Echo This Text</m:echoIn>
  </env:Body>
</env:Envelope>
